[
  {
    "text": "I dreamt I was walking along a golden beach at sunrise. The ocean was calm, and I could feel the warm sand under my feet. Suddenly, a pod of dolphins appeared, leaping joyfully in the water. I felt peaceful, free, and deeply happy.",
    "date": "2025-10-01",
    "mood_score": 0.9531
  },
  {
    "text": "In my dream, I was trapped in a burning building. Smoke filled the air, and I could hear people screaming. I felt terrified and helpless until I jolted awake.",
    "date": "2025-10-29",
    "mood_score": -0.9001
  },
  {
    "text": "Last night, I dreamed that I met an old friend at a café. We caught up over coffee and talked about our lives and remember old times.",
    "date": "2025-10-08",
    "mood_score": 0.4939
  },
  {
    "text": "I was waiting at a train station, watching people come and go. My train came, but I just sat on a bench. Nothing much happened.",
    "date": "2025-10-15",
    "mood_score": 0.0
  },
  {
    "text": "I dreamed that I was lost in a large city at night and I couldn’t find my way back to the hotel.",
    "date": "2025-10-22",
    "mood_score": -0.3182
  },
  {
    "text": "I was walking through a dim hallway that felt somewhat uncomfortable. I noticed the walls looked old and slightly dreary. I felt a bit uneasy and couldn't shake off a sense of mild worry. Things seemed somewhat off and I felt slightly sad. The atmosphere was rather unpleasant and I experienced some disappointment. Everything felt a little wrong and I had a sense of minor concern about the situation",
    "date": "2025-10-05",
    "mood_score": -0.9607
  },
  {
    "text": "I was walking through a park on a sunny day. I saw some nice flowers and smiled at a few people passing by. The weather was pleasant and I felt pretty good. I found a comfortable bench and sat down to enjoy the view. A bird chirped nearby and I thought it sounded cheerful. Overall, it was a decent and satisfying experience that made me feel somewhat happy.",
    "date": "2025-10-25",
    "mood_score": 0.9871
  },
  {
    "text": "I spent the entire dream sorting through old papers in a plain, quiet office. I was just meticulously filing documents. Nothing exciting happened, but it wasn't unpleasant—just a mundane and orderly task.",
    "date": "2025-10-12",
    "mood_score": -0.0808
  },
  {
    "text": "I was at a lively festival with old friends I hadn't seen in years. We laughed and danced to upbeat music. It was a comforting and happy reunion, though I felt a brief moment of confusion when I couldn't find my phone.",
    "date": "2025-10-20",
    "mood_score": 0.9468
  }
]